[
  {
    "id": "http://arxiv.org/abs/2505.21575v1",
    "title": "StreamLink: Large-Language-Model Driven Distributed Data Engineering System",
    "summary": "Large Language Models (LLMs) have shown remarkable proficiency in natural language understanding (NLU), opening doors for innovative applications. We introduce StreamLink - an LLM-driven distributed data system designed to improve the efficiency and accessibility of data engineering tasks. We build StreamLink on top of distributed frameworks such as Apache Spark and Hadoop to handle large data at scale. One of the important design philosophies of StreamLink is to respect user data privacy by utilizing local fine-tuned LLMs instead of a public AI service like ChatGPT. With help from domain-adapted LLMs, we can improve our system's understanding of natural language queries from users in various scenarios and simplify the procedure of generating database queries like the Structured Query Language (SQL) for information processing. We also incorporate LLM-based syntax and security checkers to guarantee the reliability and safety of each generated query. StreamLink illustrates the potential of merging generative LLMs with distributed data processing for comprehensive and user-centric data engineering. With this architecture, we allow users to interact with complex database systems at different scales in a user-friendly and security-ensured manner, where the SQL generation reaches over 10\\% of execution accuracy compared to baseline methods, and allow users to find the most concerned item from hundreds of millions of items within a few seconds using natural language.",
    "link": "http://arxiv.org/abs/2505.21575v1",
    "source": "arXiv",
    "topic": "Data Engineering",
    "dateAdded": "2025-12-05T18:27:54.836Z"
  },
  {
    "id": "39630060",
    "title": "Genetic engineering of RuBisCO by multiplex CRISPR editing small subunits in rice.",
    "summary": "No abstract available via summary API. Please click link to read.",
    "link": "https://pubmed.ncbi.nlm.nih.gov/39630060/",
    "source": "PubMed",
    "topic": "CRISPR",
    "dateAdded": "2025-12-05T18:27:55.043Z"
  },
  {
    "id": "http://arxiv.org/abs/2511.07663v2",
    "title": "Cortex AISQL: A Production SQL Engine for Unstructured Data",
    "summary": "Snowflake's Cortex AISQL is a production SQL engine that integrates native semantic operations directly into SQL. This integration allows users to write declarative queries that combine relational operations with semantic reasoning, enabling them to query both structured and unstructured data effortlessly. However, making semantic operations efficient at production scale poses fundamental challenges. Semantic operations are more expensive than traditional SQL operations, possess distinct latency and throughput characteristics, and their cost and selectivity are unknown during query compilation. Furthermore, existing query engines are not designed to optimize semantic operations. The AISQL query execution engine addresses these challenges through three novel techniques informed by production deployment data from Snowflake customers. First, AI-aware query optimization treats AI inference cost as a first-class optimization objective, reasoning about large language model (LLM) cost directly during query planning to achieve 2-8$\\times$ speedups. Second, adaptive model cascades reduce inference costs by routing most rows through a fast proxy model while escalating uncertain cases to a powerful oracle model, achieving 2-6$\\times$ speedups while maintaining 90-95% of oracle model quality. Third, semantic join query rewriting lowers the quadratic time complexity of join operations to linear through reformulation as multi-label classification tasks, achieving 15-70$\\times$ speedups with often improved prediction quality. AISQL is deployed in production at Snowflake, where it powers diverse customer workloads across analytics, search, and content understanding.",
    "link": "http://arxiv.org/abs/2511.07663v2",
    "source": "arXiv",
    "topic": "Data Engineering",
    "dateAdded": "2025-12-06T15:40:48.334Z"
  },
  {
    "id": "39630060",
    "title": "Genetic engineering of RuBisCO by multiplex CRISPR editing small subunits in rice.",
    "summary": "No abstract available via summary API. Please click link to read.",
    "link": "https://pubmed.ncbi.nlm.nih.gov/39630060/",
    "source": "PubMed",
    "topic": "CRISPR",
    "dateAdded": "2025-12-06T15:40:48.640Z"
  },
  {
    "id": "http://arxiv.org/abs/2511.08232v1",
    "title": "OWLAPY: A Pythonic Framework for OWL Ontology Engineering",
    "summary": "In this paper, we introduce OWLAPY, a comprehensive Python framework for OWL ontology engineering. OWLAPY streamlines the creation, modification, and serialization of OWL 2 ontologies. It uniquely integrates native Python-based reasoners with support for external Java reasoners, offering flexibility for users. OWLAPY facilitates multiple implementations of core ontology components and provides robust conversion capabilities between OWL class expressions and formats such as Description Logics, Manchester Syntax, and SPARQL. It also allows users to define custom workflows to leverage large language models (LLMs) in ontology generation from natural language text. OWLAPY serves as a well-tested software framework for users seeking a flexible Python library for advanced ontology engineering, including those transitioning from Java-based environments. The project is publicly available on GitHub at https://github.com/dice-group/owlapy and on the Python Package Index (PyPI) at https://pypi.org/project/owlapy/ , with over 50,000 downloads at the time of writing.",
    "link": "http://arxiv.org/abs/2511.08232v1",
    "source": "arXiv",
    "topic": "Python",
    "dateAdded": "2025-12-06T15:40:48.819Z"
  }
]