[
  {
    "date": "2026-02-06T13:25:15.924Z",
    "status": "Delays",
    "details": [
      "Northbound: 96 St-bound trains are having longer wait times between Avenue M and Lexington Av/63 St (up to 12 mins, normally every 9 mins).",
      "Southbound: Coney Island - Stillwell Av-bound trains are having longer wait times between Avenue U and Neck Rd (up to 14 mins, normally every 10 mins)."
    ]
  },
  {
    "date": "2026-02-05T13:27:19.383Z",
    "status": "Delays",
    "details": [
      "Northbound: 96 St-bound trains are having longer wait times between Coney Island - Stillwell Av and Avenue U (up to 13 mins, normally every 9 mins).",
      "Southbound: Coney Island - Stillwell Av-bound trains are having longer wait times between Sheepshead Bay and Brighton Beach (up to 16 mins, normally every 10 mins)."
    ]
  },
  {
    "date": "2026-02-04T13:25:43.244Z",
    "status": "Delays",
    "details": [
      "Southbound: Coney Island - Stillwell Av-bound trains are having longer wait times between Sheepshead Bay and Coney Island - Stillwell Av (up to 19 mins, normally every 10 mins)."
    ]
  },
  {
    "date": "2026-02-03T13:25:24.066Z",
    "status": "Service Change",
    "details": [
      "Northbound: 96 St-bound trains are running in 2 sections: between Coney Island - Stillwell Av and 96 St, and between 86 St (W 7 St) and 96 St via <N>.",
      "Northbound: Some 96 St-bound trains are running via <W> between DeKalb Av and Canal St."
    ]
  },
  {
    "date": "2026-02-01T13:16:59.667Z",
    "status": "Service Change",
    "details": [
      "Northbound: Some 96 St-bound trains are making local stops between Times Sq - 42 St and 57 St - 7 Av."
    ]
  },
  {
    "date": "2026-01-31T13:16:27.336Z",
    "status": "Delays",
    "details": [
      "Northbound: 96 St-bound trains are having longer wait times between W 8 St - NY Aquarium and 96 St (up to 16 mins, normally every 11 mins).",
      "Southbound: Coney Island - Stillwell Av-bound trains are having longer wait times between Atlantic Av - Barclays Ctr and Neck Rd (up to 17 mins, normally every 11 mins)."
    ]
  },
  {
    "date": "2026-01-30T13:23:07.983Z",
    "status": "Service Change",
    "details": [
      "Southbound: Some Coney Island - Stillwell Av-bound trains are making local stops between 57 St - 7 Av and Times Sq - 42 St."
    ]
  },
  {
    "date": "2026-01-29T13:24:04.155Z",
    "status": "Delays",
    "details": [
      "Southbound: Coney Island - Stillwell Av-bound trains are having longer wait times between DeKalb Av and 7 Av (up to 16 mins, normally every 10 mins)."
    ]
  },
  {
    "date": "2026-01-28T13:18:12.232Z",
    "status": "Delays",
    "details": [
      "Northbound: 96 St-bound trains are having longer wait times at 14 St - Union Sq (up to 12 mins, normally every 9 mins).",
      "Southbound: Coney Island - Stillwell Av-bound trains are having longer wait times between Avenue H and Kings Hwy (up to 15 mins, normally every 10 mins)."
    ]
  },
  {
    "date": "2026-01-27T13:17:36.034Z",
    "status": "Delays",
    "details": [
      "Northbound: 96 St-bound trains are taking 8 mins longer to travel between Coney Island - Stillwell Av and Avenue U, and having longer wait times between W 8 St - NY Aquarium and 34 St - Herald Sq (up to 14 mins, normally every 9 mins).",
      "Southbound: Coney Island - Stillwell Av-bound trains are having longer wait times between 34 St - Herald Sq and Newkirk Plaza (up to 15 mins, normally every 10 mins)."
    ]
  },
  {
    "date": "2026-01-25T13:12:38.109Z",
    "status": "Service Change",
    "details": [
      "<Q> trains are making local stops between 57 St - 7 Av and Canal St."
    ]
  },
  {
    "date": "2026-01-24T13:11:43.031Z",
    "status": "Service Change",
    "details": [
      "<Q> trains are making local stops between 57 St - 7 Av and Canal St."
    ]
  },
  {
    "date": "2026-01-23T13:16:28.844Z",
    "status": "Delays",
    "details": [
      "Northbound: 96 St-bound trains are having longer wait times at Church Av (up to 12 mins, normally every 9 mins)."
    ]
  },
  {
    "date": "2026-01-22T13:17:28.564Z",
    "status": "Delays",
    "details": [
      "Northbound: 96 St-bound trains are having longer wait times at 57 St - 7 Av (up to 12 mins, normally every 9 mins).",
      "Southbound: Coney Island - Stillwell Av-bound trains are having longer wait times between DeKalb Av and Avenue J (up to 15 mins, normally every 10 mins)."
    ]
  },
  {
    "date": "2026-01-21T13:17:25.959Z",
    "status": "Good Service",
    "details": []
  },
  {
    "date": "2026-01-20T13:17:41.068Z",
    "status": "Delays",
    "details": [
      "Northbound: 96 St-bound trains are taking 6 mins longer to travel per trip.",
      "Southbound: Coney Island - Stillwell Av-bound trains are having longer wait times at Ocean Pkwy (up to 12 mins, normally every 10 mins)."
    ]
  },
  {
    "date": "2026-01-18T13:10:46.245Z",
    "status": "Service Change",
    "details": [
      "Northbound: 96 St-bound trains are running via <W> between DeKalb Av and Canal St."
    ]
  },
  {
    "date": "2026-01-17T13:10:30.190Z",
    "status": "Service Change",
    "details": [
      "Northbound: 96 St-bound trains are running via <W> between DeKalb Av and Canal St."
    ]
  },
  {
    "date": "2026-01-16T13:14:28.573Z",
    "status": "Service Change",
    "details": [
      "Northbound: Some 96 St-bound trains are making local stops between Times Sq - 42 St and 57 St - 7 Av."
    ]
  },
  {
    "date": "2026-01-15T13:15:15.686Z",
    "status": "Service Change",
    "details": [
      "Southbound: Some Coney Island - Stillwell Av-bound trains are skipping Parkside Av, Beverley Rd, Cortelyou Rd, Avenue H, Avenue J, Avenue M, Avenue U, Neck Rd, Ocean Pkwy, and W 8 St - NY Aquarium."
    ]
  },
  {
    "date": "2026-01-14T13:15:29.859Z",
    "status": "Delays",
    "details": [
      "Northbound: 96 St-bound trains are having longer wait times between Coney Island - Stillwell Av and Parkside Av (up to 18 mins, normally every 9 mins).",
      "Southbound: Coney Island - Stillwell Av-bound trains are having longer wait times between Brighton Beach and Coney Island - Stillwell Av (up to 14 mins, normally every 10 mins)."
    ]
  },
  {
    "date": "2026-01-13T13:15:50.790Z",
    "status": "Delays",
    "details": [
      "Northbound: 96 St-bound trains are having longer wait times between 14 St - Union Sq and 34 St - Herald Sq (up to 11 mins, normally every 9 mins).",
      "Southbound: Coney Island - Stillwell Av-bound trains are having longer wait times between Avenue M and Sheepshead Bay (up to 21 mins, normally every 10 mins)."
    ]
  },
  {
    "date": "2026-01-12T13:15:51.804Z",
    "status": "Delays",
    "details": [
      "Northbound: 96 St-bound trains are having longer wait times between Avenue M and 14 St - Union Sq (up to 12 mins, normally every 9 mins).",
      "Southbound: Coney Island - Stillwell Av-bound trains are having longer wait times between Kings Hwy and Sheepshead Bay (up to 17 mins, normally every 10 mins)."
    ]
  },
  {
    "date": "2026-01-11T13:11:27.730Z",
    "status": "Delays",
    "details": [
      "Northbound: 96 St-bound trains are having longer wait times between Canal St and 96 St (up to 16 mins, normally every 12 mins)."
    ]
  },
  {
    "date": "2026-01-10T13:10:57.530Z",
    "status": "Delays",
    "details": [
      "Northbound: 96 St-bound trains are having longer wait times between Sheepshead Bay and Prospect Park (up to 15 mins, normally every 11 mins).",
      "Southbound: Coney Island - Stillwell Av-bound trains are having longer wait times between 7 Av and Atlantic Av - Barclays Ctr (up to 13 mins, normally every 11 mins)."
    ]
  },
  {
    "date": "2026-01-09T13:14:43.493Z",
    "status": "Service Change",
    "details": [
      "Southbound: Some Coney Island - Stillwell Av-bound trains are making local stops between 57 St - 7 Av and Times Sq - 42 St."
    ]
  },
  {
    "date": "2026-01-08T13:15:25.573Z",
    "status": "Service Change",
    "details": [
      "Northbound: 96 St-bound trains are running in 2 sections: between Coney Island - Stillwell Av and 96 St, and between Canal St and 96 St.",
      "Southbound: Coney Island - Stillwell Av-bound trains are running in 2 sections: between 96 St and Coney Island - Stillwell Av, and between Cortlandt St and Coney Island - Stillwell Av via <R>."
    ]
  },
  {
    "date": "2026-01-07T13:14:58.567Z",
    "status": "Delays",
    "details": [
      "Southbound: Coney Island - Stillwell Av-bound trains are having longer wait times between Avenue H and Avenue J (up to 14 mins, normally every 10 mins)."
    ]
  },
  {
    "date": "2026-01-06T13:14:35.744Z",
    "status": "Delays",
    "details": [
      "Southbound: Coney Island - Stillwell Av-bound trains are having longer wait times at Kings Hwy (up to 13 mins, normally every 10 mins)."
    ]
  },
  {
    "date": "2026-01-05T13:15:31.242Z",
    "status": "Service Change",
    "details": [
      "Northbound: 96 St-bound trains are running in 4 sections: between Coney Island - Stillwell Av and 96 St, between 86 St (W 7 St) and 96 St via <N>, between Whitehall St - South Ferry and 96 St via <W>, and between Grand St and 96 St via <D> and <F>."
    ]
  }
]